Repository: massidea/site
Catalog: application/languages/admin.tmx
Source language: fi
Languages: en

source: Vain ylläpitäjillä on pääsy ylläpitopuolelle!
en: Only administrators may access the administrative side!

source: Kyseistä käyttäjätunnusta ei löydy!
en: No such username!

source: Käyttäjänimi puuttuu!
en: Username missing!

source: Käyttäjänimi ja/tai rooli puuttuu!
en: Username and/or role missing!

source: Roolin lisäys onnistui!
en: Adding role was successful!

source: Roolin lisäys ei onnistunut!
en: Adding role was not successful!

source: Lisättävää roolia ei ole olemassa!
en: Role doesn't exist!

source: Roolin poistaminen onnistui!
en: Removing role was successful!

source: Roolin poistaminen ei onnistunut!
en: Removing role was not successful!

source: Käyttäjällä ei ole poistettavaa roolia!
en: User hasn't got the role that was tried to be removed!

source: Ylläpitopuoli
en: Administration

source: Tehtävät:
en: Tasks:

source: Lisää uusia rooleja tietokantaan
en: Add new roles to the database

source: Ylläpitopuoli - roolien hallinta
en: Administration - manage roles

source: Lisää uusi rooli
en: Add a new role

source: Muokkaa roolia
en: Edit a role

source: Poista rooli
en: Remove a role

source: Ylläpitopuoli - roolien hallinta - lisää uusi rooli
en: Administration - manage roles - add a new role

source: Ylläpitopuoli - roolien hallinta - muokkaa roolia
en: Administration - manage roles - edit a role

source: Ylläpitopuoli - roolien hallinta - poista rooli
en: Administration - manage roles - remove a role

source: Muokkaa tietyn käyttäjän rooleja
en: Edit roles of specific user

source: Navigoi ensin muokattavan käyttäjän profiilisivulle, ja sitten klikkaa 'Muokkaa tämän käyttäjän rooleja' Ylläpitotyökalut-laatikosta.
en: Navigate first to the profile page of the specific user, and then click 'Edit roles of this user' at the Administrative tools box.

source: Ylläpitotyökalut:
en: Administrative tools:

source: Muokkaa tämän käyttäjän rooleja
en: Edit roles of this user

source: Ylläpitopuoli - muokkaa rooleja käyttäjälle
en: Administration - edit roles for user

source: Nykyiset roolit:
en: Current roles:

source: Lisää uusia rooleja:
en: Add new roles:

source: Ei voi poistaa
en: Can't be removed

source: lisää
en: add

source: poista
en: remove

source: Oletko varma?
en: Are you sure?

source: Kyllä
en: Yes

source: Ei
en: No

source: Käyttäjällä ei ole rooleja!
en: User has no roles!

source: Katso ja muokkaa merkattuja kommentteja
en: View and manage flagged comments

source: Merkatut kommentit
en: Flagged comments

source: Sisällön nimi
en: Content title

source: Merkattuja kertoja
en: Flag count

source: Kommentti
en: Comment

source: Hallinta
en: Manage

source: Hallitse valittuja kohteita
en: Manage selected items

source: Poista kommentit
en: Remove comments

source: Poista merkinnät
en: Remove flags

source: Poista molemmat
en: Remove both

source: Suorita
en: Submit

source: Merkintöjä yhteensä:
en: Total count:

source: Merkintöjä ei löytynyt
en: No flags found

source: Katso ja muokkaa merkattuja sisältöjä
en: View and manage flagged content

source: Merkatut sisällöt
en: Flagged content

source: Poista valitut sisällöt
en: Remove selected contents

source: Poista valitut merkinnät
en: Remove selected flags

source: Poista julkaisumerkinnät valituista kohteista
en: Unpublish selected items

source: Poista molemmat valituista kohteista
en: Remove both from selected items
